wrk2/wrk_temp.log
Running 2m test @ http://192.168.49.2:30918
  4 threads and 100 connections

  Thread calibration: mean lat.: 3.157ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.149ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.188ms, rate sampling interval: 16ms
  Thread calibration: mean lat.: 3.200ms, rate sampling interval: 16ms

-----------------------------------------------------------------------
Test Results @ http://192.168.49.2:30918 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.23ms    3.87ms  14.70ms   85.53%
    Req/Sec     1.04k   264.58     1.73k    67.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.44ms
 75.000%    4.97ms
 90.000%    8.44ms
 99.000%   14.70ms
 99.900%   26.48ms
 99.990%   82.24ms
 99.999%  111.42ms
100.000%  121.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.145     0.000000            1         1.00
       0.520     0.100000        32214         1.11
       0.592     0.200000        64344         1.25
       0.795     0.300000        96410         1.43
       1.119     0.400000       128535         1.67
       1.438     0.500000       160669         2.00
       1.655     0.550000       176747         2.22
       1.998     0.600000       192776         2.50
       3.043     0.650000       208830         2.86
       4.147     0.700000       224937         3.33
       4.967     0.750000       240946         4.00
       5.395     0.775000       249005         4.44
       5.863     0.800000       257013         5.00
       6.387     0.825000       265089         5.71
       6.971     0.850000       273100         6.67
       7.643     0.875000       281136         8.00
       8.027     0.887500       285153         8.89
       8.439     0.900000       289192        10.00
       8.879     0.912500       293198        11.43
       9.383     0.925000       297162        13.33
       9.959     0.937500       301214        16.00
      10.263     0.943750       303191        17.78
      10.615     0.950000       305216        20.00
      10.983     0.956250       307205        22.86
      11.399     0.962500       309223        26.67
      11.879     0.968750       311239        32.00
      12.151     0.971875       312254        35.56
      12.447     0.975000       313236        40.00
      12.775     0.978125       314230        45.71
      13.167     0.981250       315237        53.33
      13.607     0.984375       316246        64.00
      13.871     0.985938       316752        71.11
      14.159     0.987500       317250        80.00
      14.487     0.989062       317748        91.43
      14.871     0.990625       318245       106.67
      15.319     0.992188       318749       128.00
      15.607     0.992969       319004       142.22
      15.943     0.993750       319249       160.00
      16.343     0.994531       319506       182.86
      16.879     0.995313       319756       213.33
      17.519     0.996094       320007       256.00
      17.967     0.996484       320129       284.44
      18.463     0.996875       320255       320.00
      19.007     0.997266       320378       365.71
      19.743     0.997656       320503       426.67
      20.671     0.998047       320628       512.00
      21.247     0.998242       320693       568.89
      21.951     0.998437       320754       640.00
      23.135     0.998633       320816       731.43
      24.543     0.998828       320879       853.33
      26.863     0.999023       320942      1024.00
      29.599     0.999121       320974      1137.78
      32.895     0.999219       321005      1280.00
      37.055     0.999316       321036      1462.86
      42.271     0.999414       321067      1706.67
      50.175     0.999512       321099      2048.00
      52.767     0.999561       321114      2275.56
      54.975     0.999609       321130      2560.00
      57.695     0.999658       321146      2925.71
      62.975     0.999707       321161      3413.33
      69.439     0.999756       321177      4096.00
      71.551     0.999780       321186      4551.11
      73.151     0.999805       321193      5120.00
      74.815     0.999829       321201      5851.43
      78.207     0.999854       321208      6826.67
      80.127     0.999878       321216      8192.00
      81.855     0.999890       321221      9102.22
      82.431     0.999902       321224     10240.00
      83.007     0.999915       321228     11702.86
      84.927     0.999927       321232     13653.33
      87.039     0.999939       321237     16384.00
      87.743     0.999945       321238     18204.44
      88.703     0.999951       321240     20480.00
      89.535     0.999957       321242     23405.71
      90.367     0.999963       321244     27306.67
      92.415     0.999969       321246     32768.00
      94.015     0.999973       321247     36408.89
      94.399     0.999976       321248     40960.00
     100.479     0.999979       321249     46811.43
     103.743     0.999982       321250     54613.33
     107.519     0.999985       321251     65536.00
     107.519     0.999986       321251     72817.78
     111.423     0.999988       321252     81920.00
     111.423     0.999989       321252     93622.86
     112.703     0.999991       321253    109226.67
     112.703     0.999992       321253    131072.00
     112.703     0.999993       321253    145635.56
     113.599     0.999994       321254    163840.00
     113.599     0.999995       321254    187245.71
     113.599     0.999995       321254    218453.33
     113.599     0.999996       321254    262144.00
     113.599     0.999997       321254    291271.11
     121.407     0.999997       321255    327680.00
     121.407     1.000000       321255          inf
#[Mean    =        3.230, StdDeviation   =        3.872]
#[Max     =      121.344, Total count    =       321255]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  361126 requests in 1.50m, 119.13MB read
Requests/sec:   4012.54  
Transfer/sec:      1.32MB